; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image5 - mode
	spectrograph0 - mode
	thermograph8 - mode
	infrared6 - mode
	image9 - mode
	infrared2 - mode
	spectrograph4 - mode
	spectrograph1 - mode
	thermograph7 - mode
	thermograph3 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star2 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 image9)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared6)
	(supports instrument1 thermograph3)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph8)
	(supports instrument1 image5)
	(calibration_target instrument1 Star2)
	(supports instrument2 thermograph7)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
)
(:goal (and
	(have_image Phenomenon5 thermograph7)
	(have_image Phenomenon5 image5)
	(have_image Phenomenon5 thermograph3)
	(have_image Phenomenon6 image9)
	(have_image Phenomenon7 thermograph8)
	(have_image Phenomenon7 thermograph3)
	(have_image Phenomenon8 thermograph3)
	(have_image Planet9 thermograph7)
	(have_image Planet9 thermograph8)
	(have_image Planet9 infrared6)
	(have_image Planet10 thermograph7)
	(have_image Planet10 image9)
	(have_image Planet11 spectrograph4)
	(have_image Planet11 infrared2)
	(have_image Star12 thermograph7)
))

)

; plan
1. (turn_to satellite0 groundstation4 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 15
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 15
3. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 15
4. (turn_to satellite0 planet11 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet11)
   goals met: 0 of 15
5. (take_image satellite0 planet11 instrument0 spectrograph4)
   added: (have_image planet11 spectrograph4)
   goals met: 1 of 15
6. (take_image satellite0 planet11 instrument0 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 2 of 15
7. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   goals met: 2 of 15
8. (take_image satellite0 planet10 instrument0 image9)
   added: (have_image planet10 image9)
   goals met: 3 of 15
9. (turn_to satellite0 phenomenon6 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 15
10. (take_image satellite0 phenomenon6 instrument0 image9)
   added: (have_image phenomenon6 image9)
   goals met: 4 of 15
11. (turn_to satellite0 star2 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star2)
   goals met: 4 of 15
12. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 15
13. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 15
14. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 4 of 15
15. (turn_to satellite0 phenomenon8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 15
16. (take_image satellite0 phenomenon8 instrument1 thermograph3)
   added: (have_image phenomenon8 thermograph3)
   goals met: 5 of 15
17. (turn_to satellite0 phenomenon5 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon5)
   goals met: 5 of 15
18. (take_image satellite0 phenomenon5 instrument1 thermograph3)
   added: (have_image phenomenon5 thermograph3)
   goals met: 6 of 15
19. (take_image satellite0 phenomenon5 instrument1 image5)
   added: (have_image phenomenon5 image5)
   goals met: 7 of 15
20. (turn_to satellite0 phenomenon7 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon7)
   goals met: 7 of 15
21. (take_image satellite0 phenomenon7 instrument1 thermograph3)
   added: (have_image phenomenon7 thermograph3)
   goals met: 8 of 15
22. (take_image satellite0 phenomenon7 instrument1 thermograph8)
   added: (have_image phenomenon7 thermograph8)
   goals met: 9 of 15
23. (turn_to satellite0 planet9 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet9)
   goals met: 9 of 15
24. (take_image satellite0 planet9 instrument1 infrared6)
   added: (have_image planet9 infrared6)
   goals met: 10 of 15
25. (take_image satellite0 planet9 instrument1 thermograph8)
   added: (have_image planet9 thermograph8)
   goals met: 11 of 15
26. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 11 of 15
27. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 11 of 15
28. (turn_to satellite0 star2 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star2)
   goals met: 11 of 15
29. (calibrate satellite0 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 11 of 15
30. (turn_to satellite0 phenomenon5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon5)
   goals met: 11 of 15
31. (take_image satellite0 phenomenon5 instrument2 thermograph7)
   added: (have_image phenomenon5 thermograph7)
   goals met: 12 of 15
32. (turn_to satellite0 planet10 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet10)
   goals met: 12 of 15
33. (take_image satellite0 planet10 instrument2 thermograph7)
   added: (have_image planet10 thermograph7)
   goals met: 13 of 15
34. (turn_to satellite0 planet9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet9)
   goals met: 13 of 15
35. (take_image satellite0 planet9 instrument2 thermograph7)
   added: (have_image planet9 thermograph7)
   goals met: 14 of 15
36. (turn_to satellite0 star12 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star12)
   goals met: 14 of 15
37. (take_image satellite0 star12 instrument2 thermograph7)
   added: (have_image star12 thermograph7)
   goals met: 15 of 15
